In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [2]:
engine = create_engine('mysql+pymysql://root:AQib.21Talib@localhost')  # connect to server
engine.execute("create database if not exists join_sample") #create db
engine = create_engine('mysql+pymysql://root:AQib.21Talib@localhost/join_sample')

In [3]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='AQib.21Talib',
                             db='join_sample',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [4]:
sql_query = """
drop table if exists TableA;
drop table if exists TableB;
create table TableA(
 id integer,
 name varchar(1000)
);
create table TableB(
 id integer,
 name varchar(1000)
);

insert into TableA(id, name) values 
(1, 'Pirate'),
(2, 'Monkey'),
(3, 'Ninja'),
(4, 'Spaghetti');
insert into TableB(id, name) values 
(1, 'Rutabaga'),
(2, 'Pirate'),
(3, 'Darth Vader'),
(4, 'Ninja');
"""
RunSQL(sql_query)

In [5]:
table_a = pd.read_sql_query('select * from TableA', engine)
table_a.head()

   id       name
0   1     Pirate
1   2     Monkey
2   3      Ninja
3   4  Spaghetti

In [19]:
table_b = pd.read_sql_query('select * from TableB', engine)
table_b.head()

   id         name
0   1     Rutabaga
1   2       Pirate
2   3  Darth Vader
3   4        Ninja

* A **join** allows you to relate similar data in different tables.

* A **union** returns the results of two different queries as a single recordset.

In [23]:
sql_query = """
select * from TableA
inner join TableB
on TableA.name = TableB.name
"""
inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   id    name  id    name
0   1  Pirate   2  Pirate
1   3   Ninja   4   Ninja

In [25]:
sql_query = """
select * from TableA
where id between 1 and 2
union
select * from TableB
where id between 3 and 4
"""
inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   id         name
0   1       Pirate
1   2       Monkey
2   3  Darth Vader
3   4        Ninja